Revit 2027 API
UnitTypeId.SquareMeters Property
 Square meters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SquareMeters { get; }
Public Shared ReadOnly Property SquareMeters As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SquareMeters {
	ForgeTypeId^ get ();
}
static member SquareMeters : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace